nxp-mcuxpresso/mcux-devices-mcx/MCXA/MCXA556/iar/startup_MCXA556.s
        PUBWEAK GPIO0_1_IRQHandler
        PUBWEAK GPIO0_1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO0_1_IRQHandler
        LDR     R0, =GPIO0_1_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO1_1_IRQHandler
        PUBWEAK GPIO1_1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO1_1_IRQHandler
        LDR     R0, =GPIO1_1_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO2_1_IRQHandler
        PUBWEAK GPIO2_1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO2_1_IRQHandler
        LDR     R0, =GPIO2_1_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO3_1_IRQHandler
        PUBWEAK GPIO3_1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO3_1_IRQHandler
        LDR     R0, =GPIO3_1_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO4_1_IRQHandler
        PUBWEAK GPIO4_1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO4_1_IRQHandler
        LDR     R0, =GPIO4_1_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO5_1_IRQHandler
        PUBWEAK GPIO5_1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
GPIO5_1_IRQHandler
        LDR     R0, =GPIO5_1_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved148_IRQHandler
        PUBWEAK Reserved148_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved148_IRQHandler
        LDR     R0, =Reserved148_DriverIRQHandler
        BX      R0

        PUBWEAK ITRC0_IRQHandler
        PUBWEAK ITRC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ITRC0_IRQHandler
        LDR     R0, =ITRC0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH8_IRQHandler
        PUBWEAK DMA0_CH8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH8_IRQHandler
        LDR     R0, =DMA0_CH8_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH9_IRQHandler
        PUBWEAK DMA0_CH9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH9_IRQHandler
        LDR     R0, =DMA0_CH9_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH10_IRQHandler
        PUBWEAK DMA0_CH10_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH10_IRQHandler
        LDR     R0, =DMA0_CH10_DriverIRQHandler
        BX      R0

        PUBWEAK DMA0_CH11_IRQHandler
        PUBWEAK DMA0_CH11_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA0_CH11_IRQHandler
        LDR     R0, =DMA0_CH11_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved154_IRQHandler
        PUBWEAK Reserved154_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved154_IRQHandler
        LDR     R0, =Reserved154_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved155_IRQHandler
        PUBWEAK Reserved155_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved155_IRQHandler
        LDR     R0, =Reserved155_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved156_IRQHandler
        PUBWEAK Reserved156_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved156_IRQHandler
        LDR     R0, =Reserved156_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved157_IRQHandler
        PUBWEAK Reserved157_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved157_IRQHandler
        LDR     R0, =Reserved157_DriverIRQHandler
        BX      R0

        PUBWEAK DMA1_CH0_IRQHandler
        PUBWEAK DMA1_CH0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA1_CH0_IRQHandler
        LDR     R0, =DMA1_CH0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA1_CH1_IRQHandler
        PUBWEAK DMA1_CH1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA1_CH1_IRQHandler
        LDR     R0, =DMA1_CH1_DriverIRQHandler
        BX      R0

        PUBWEAK DMA1_CH2_IRQHandler
        PUBWEAK DMA1_CH2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA1_CH2_IRQHandler
        LDR     R0, =DMA1_CH2_DriverIRQHandler
        BX      R0

        PUBWEAK DMA1_CH3_IRQHandler
        PUBWEAK DMA1_CH3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA1_CH3_IRQHandler
        LDR     R0, =DMA1_CH3_DriverIRQHandler
        BX      R0

Reserved16_DriverIRQHandler
CMC_DriverIRQHandler
DMA0_CH0_DriverIRQHandler
DMA0_CH1_DriverIRQHandler
DMA0_CH2_DriverIRQHandler
DMA0_CH3_DriverIRQHandler
DMA0_CH4_DriverIRQHandler
DMA0_CH5_DriverIRQHandler
DMA0_CH6_DriverIRQHandler
DMA0_CH7_DriverIRQHandler
ERM0_SINGLE_BIT_DriverIRQHandler
ERM0_MULTI_BIT_DriverIRQHandler
FMU0_DriverIRQHandler
GLIKEY0_DriverIRQHandler
MBC0_DriverIRQHandler
SCG0_DriverIRQHandler
SPC0_DriverIRQHandler
TDET_DriverIRQHandler
WUU0_DriverIRQHandler
CAN0_DriverIRQHandler
CAN1_DriverIRQHandler
Reserved37_DriverIRQHandler
Reserved38_DriverIRQHandler
FLEXIO_DriverIRQHandler
I3C0_DriverIRQHandler
I3C1_DriverIRQHandler
LPI2C0_DriverIRQHandler
LPI2C1_DriverIRQHandler
LPSPI0_DriverIRQHandler
LPSPI1_DriverIRQHandler
LPSPI2_DriverIRQHandler
LPUART0_DriverIRQHandler
LPUART1_DriverIRQHandler
LPUART2_DriverIRQHandler
LPUART3_DriverIRQHandler
LPUART4_DriverIRQHandler
Reserved52_DriverIRQHandler
Reserved53_DriverIRQHandler
CDOG0_DriverIRQHandler
CTIMER0_DriverIRQHandler
CTIMER1_DriverIRQHandler
CTIMER2_DriverIRQHandler
CTIMER3_DriverIRQHandler
CTIMER4_DriverIRQHandler
Reserved60_DriverIRQHandler
Reserved61_DriverIRQHandler
Reserved62_DriverIRQHandler
Reserved63_DriverIRQHandler
Reserved64_DriverIRQHandler
Reserved65_DriverIRQHandler
Reserved66_DriverIRQHandler
Reserved67_DriverIRQHandler
Reserved68_DriverIRQHandler
Reserved69_DriverIRQHandler
FREQME0_DriverIRQHandler
LPTMR0_DriverIRQHandler
Reserved72_DriverIRQHandler
OS_EVENT_DriverIRQHandler
WAKETIMER0_DriverIRQHandler
UTICK0_DriverIRQHandler
WWDT0_DriverIRQHandler
WWDT1_DriverIRQHandler
ADC0_DriverIRQHandler
ADC1_DriverIRQHandler
CMP0_DriverIRQHandler
Reserved81_DriverIRQHandler
Reserved82_DriverIRQHandler
DAC0_DriverIRQHandler
DAC1_DriverIRQHandler
Reserved85_DriverIRQHandler
Reserved86_DriverIRQHandler
GPIO0_DriverIRQHandler
GPIO1_DriverIRQHandler
GPIO2_DriverIRQHandler
GPIO3_DriverIRQHandler
GPIO4_DriverIRQHandler
GPIO5_DriverIRQHandler
LPI2C2_DriverIRQHandler
LPI2C3_DriverIRQHandler
Reserved95_DriverIRQHandler
Reserved96_DriverIRQHandler
Reserved97_DriverIRQHandler
Reserved98_DriverIRQHandler
Reserved99_DriverIRQHandler
Reserved100_DriverIRQHandler
Reserved101_DriverIRQHandler
Reserved102_DriverIRQHandler
Reserved103_DriverIRQHandler
Reserved104_DriverIRQHandler
ESPI_DriverIRQHandler
ETHERNET_DriverIRQHandler
ETHERNET_PMT_DriverIRQHandler
Reserved108_DriverIRQHandler
TENBASET_PHY0_DriverIRQHandler
I3C2_DriverIRQHandler
LPUART5_DriverIRQHandler
Reserved112_DriverIRQHandler
LPSPI3_DriverIRQHandler
LPSPI4_DriverIRQHandler
LPSPI5_DriverIRQHandler
LPI2C4_DriverIRQHandler
I3C3_DriverIRQHandler
Reserved118_DriverIRQHandler
USB1_HS_DriverIRQHandler
USB1_HS_PHY_DriverIRQHandler
Reserved121_DriverIRQHandler
FLEXSPI0_DriverIRQHandler
Reserved123_DriverIRQHandler
SMARTDMA_DriverIRQHandler
CDOG1_DriverIRQHandler
PKC_DriverIRQHandler
SGI_DriverIRQHandler
SPI_FILTER_DriverIRQHandler
TRNG0_DriverIRQHandler
SECURE_ERR_DriverIRQHandler
SEC_HYPERVISOR_CALL_DriverIRQHandler
Reserved132_DriverIRQHandler
Reserved133_DriverIRQHandler
Reserved134_DriverIRQHandler
RTC_DriverIRQHandler
Reserved136_DriverIRQHandler
Reserved137_DriverIRQHandler
GDET_DriverIRQHandler
EWM0_DriverIRQHandler
TSI_END_OF_SCAN_DriverIRQHandler
TSI_OUT_OF_SCAN_DriverIRQHandler
GPIO0_1_DriverIRQHandler
GPIO1_1_DriverIRQHandler
GPIO2_1_DriverIRQHandler
GPIO3_1_DriverIRQHandler
GPIO4_1_DriverIRQHandler
GPIO5_1_DriverIRQHandler
Reserved148_DriverIRQHandler
ITRC0_DriverIRQHandler
DMA0_CH8_DriverIRQHandler
DMA0_CH9_DriverIRQHandler
DMA0_CH10_DriverIRQHandler
DMA0_CH11_DriverIRQHandler
Reserved154_DriverIRQHandler
Reserved155_DriverIRQHandler
Reserved156_DriverIRQHandler
Reserved157_DriverIRQHandler
DMA1_CH0_DriverIRQHandler
DMA1_CH1_DriverIRQHandler
DMA1_CH2_DriverIRQHandler
DMA1_CH3_DriverIRQHandler
DefaultISR
        B .

        END
